tap "derailed/k9s"

# Core CLI
brew "gh"
brew "git"
brew "jq"
brew "lazygit"
brew "mkcert"
brew "ripgrep"
brew "zstd"

# Zsh plugins (sourced by zshrc)
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Kubernetes
brew "k9s"
brew "kubernetes-cli"

# Language toolchains
brew "fnm"
brew "pnpm"
brew "ruby-build"
brew "rbenv"

# Database clients
brew "redis"
brew "mysql"

# Mac memory management and optimization
brew "mole"

# Apps
cask "1password-cli"
cask "gcloud-cli"
cask "ghostty"
cask "orbstack"

# VS Code extensions
vscode "anthropic.claude-code"
vscode "atlassian.atlascode"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "xabikos.javascriptsnippets"
vscode "yuichinukiyama.vscode-preview-server"
